grevaillot/svd_tools/headers/STM32F446/rcc.h
#define RCC_CFGR_MCO2_SHIFT		30
#define RCC_CFGR_MCO2_MASK		0x03
/** @defgroup rcc_cfgr_mco2 MCO2 Microcontroller clock output 2
@{*/
/**@}*/


#define RCC_CFGR_MCO2PRE_SHIFT		27
#define RCC_CFGR_MCO2PRE_MASK		0x07
/** @defgroup rcc_cfgr_mco2pre MCO2PRE MCO2 prescaler
@{*/
/**@}*/


#define RCC_CFGR_MCO1PRE_SHIFT		24
#define RCC_CFGR_MCO1PRE_MASK		0x07
/** @defgroup rcc_cfgr_mco1pre MCO1PRE MCO1 prescaler
@{*/
/**@}*/

/** RCC_CFGR_I2SSRC I2S clock selection **/
#define RCC_CFGR_I2SSRC		(1 << 23)

#define RCC_CFGR_MCO1_SHIFT		21
#define RCC_CFGR_MCO1_MASK		0x03
/** @defgroup rcc_cfgr_mco1 MCO1 Microcontroller clock output 1
@{*/
/**@}*/


#define RCC_CFGR_RTCPRE_SHIFT		16
#define RCC_CFGR_RTCPRE_MASK		0x1f
/** @defgroup rcc_cfgr_rtcpre RTCPRE HSE division factor for RTC clock
@{*/
/**@}*/


#define RCC_CFGR_PPRE2_SHIFT		13
#define RCC_CFGR_PPRE2_MASK		0x07
/** @defgroup rcc_cfgr_ppre2 PPRE2 APB high-speed prescaler (APB2)
@{*/
/**@}*/


#define RCC_CFGR_PPRE1_SHIFT		10
#define RCC_CFGR_PPRE1_MASK		0x07
/** @defgroup rcc_cfgr_ppre1 PPRE1 APB Low speed prescaler (APB1)
@{*/
/**@}*/


#define RCC_CFGR_HPRE_SHIFT		4
#define RCC_CFGR_HPRE_MASK		0x0f
/** @defgroup rcc_cfgr_hpre HPRE AHB prescaler
@{*/
/**@}*/

/** RCC_CFGR_SWS1 System clock switch status **/
#define RCC_CFGR_SWS1		(1 << 3)
/** RCC_CFGR_SWS0 System clock switch status **/
#define RCC_CFGR_SWS0		(1 << 2)
/** RCC_CFGR_SW1 System clock switch **/
#define RCC_CFGR_SW1		(1 << 1)
/** RCC_CFGR_SW0 System clock switch **/
#define RCC_CFGR_SW0		(1 << 0)

/**@}*/

/** @defgroup rcc_cir CIR clock interrupt register
@{*/

/** RCC_CIR_CSSC Clock security system interrupt clear **/
#define RCC_CIR_CSSC		(1 << 23)
/** RCC_CIR_PLLSAIRDYC PLLSAI Ready Interrupt Clear **/
#define RCC_CIR_PLLSAIRDYC		(1 << 22)
/** RCC_CIR_PLLI2SRDYC PLLI2S ready interrupt clear **/
#define RCC_CIR_PLLI2SRDYC		(1 << 21)
/** RCC_CIR_PLLRDYC Main PLL(PLL) ready interrupt clear **/
#define RCC_CIR_PLLRDYC		(1 << 20)
/** RCC_CIR_HSERDYC HSE ready interrupt clear **/
#define RCC_CIR_HSERDYC		(1 << 19)
/** RCC_CIR_HSIRDYC HSI ready interrupt clear **/
#define RCC_CIR_HSIRDYC		(1 << 18)
/** RCC_CIR_LSERDYC LSE ready interrupt clear **/
#define RCC_CIR_LSERDYC		(1 << 17)
/** RCC_CIR_LSIRDYC LSI ready interrupt clear **/
#define RCC_CIR_LSIRDYC		(1 << 16)
/** RCC_CIR_PLLSAIRDYIE PLLSAI Ready Interrupt Enable **/
#define RCC_CIR_PLLSAIRDYIE		(1 << 14)
/** RCC_CIR_PLLI2SRDYIE PLLI2S ready interrupt enable **/
#define RCC_CIR_PLLI2SRDYIE		(1 << 13)
/** RCC_CIR_PLLRDYIE Main PLL (PLL) ready interrupt enable **/
#define RCC_CIR_PLLRDYIE		(1 << 12)
/** RCC_CIR_HSERDYIE HSE ready interrupt enable **/
#define RCC_CIR_HSERDYIE		(1 << 11)
/** RCC_CIR_HSIRDYIE HSI ready interrupt enable **/
#define RCC_CIR_HSIRDYIE		(1 << 10)
/** RCC_CIR_LSERDYIE LSE ready interrupt enable **/
#define RCC_CIR_LSERDYIE		(1 << 9)
/** RCC_CIR_LSIRDYIE LSI ready interrupt enable **/
#define RCC_CIR_LSIRDYIE		(1 << 8)
/** RCC_CIR_CSSF Clock security system interrupt flag **/
#define RCC_CIR_CSSF		(1 << 7)
/** RCC_CIR_PLLSAIRDYF PLLSAI ready interrupt flag **/
#define RCC_CIR_PLLSAIRDYF		(1 << 6)
/** RCC_CIR_PLLI2SRDYF PLLI2S ready interrupt flag **/
#define RCC_CIR_PLLI2SRDYF		(1 << 5)
/** RCC_CIR_PLLRDYF Main PLL (PLL) ready interrupt flag **/
#define RCC_CIR_PLLRDYF		(1 << 4)
/** RCC_CIR_HSERDYF HSE ready interrupt flag **/
#define RCC_CIR_HSERDYF		(1 << 3)
/** RCC_CIR_HSIRDYF HSI ready interrupt flag **/
#define RCC_CIR_HSIRDYF		(1 << 2)
/** RCC_CIR_LSERDYF LSE ready interrupt flag **/
#define RCC_CIR_LSERDYF		(1 << 1)
/** RCC_CIR_LSIRDYF LSI ready interrupt flag **/
#define RCC_CIR_LSIRDYF		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1rstr AHB1RSTR AHB1 peripheral reset register
@{*/

/** RCC_AHB1RSTR_OTGHSRST USB OTG HS module reset **/
#define RCC_AHB1RSTR_OTGHSRST		(1 << 29)
/** RCC_AHB1RSTR_DMA2RST DMA2 reset **/
#define RCC_AHB1RSTR_DMA2RST		(1 << 22)
/** RCC_AHB1RSTR_DMA1RST DMA2 reset **/
#define RCC_AHB1RSTR_DMA1RST		(1 << 21)
/** RCC_AHB1RSTR_CRCRST CRC reset **/
#define RCC_AHB1RSTR_CRCRST		(1 << 12)
/** RCC_AHB1RSTR_GPIOHRST IO port H reset **/
#define RCC_AHB1RSTR_GPIOHRST		(1 << 7)
/** RCC_AHB1RSTR_GPIOGRST IO port G reset **/
#define RCC_AHB1RSTR_GPIOGRST		(1 << 6)
/** RCC_AHB1RSTR_GPIOFRST IO port F reset **/
#define RCC_AHB1RSTR_GPIOFRST		(1 << 5)
/** RCC_AHB1RSTR_GPIOERST IO port E reset **/
#define RCC_AHB1RSTR_GPIOERST		(1 << 4)
/** RCC_AHB1RSTR_GPIODRST IO port D reset **/
#define RCC_AHB1RSTR_GPIODRST		(1 << 3)
/** RCC_AHB1RSTR_GPIOCRST IO port C reset **/
#define RCC_AHB1RSTR_GPIOCRST		(1 << 2)
/** RCC_AHB1RSTR_GPIOBRST IO port B reset **/
#define RCC_AHB1RSTR_GPIOBRST		(1 << 1)
/** RCC_AHB1RSTR_GPIOARST IO port A reset **/
#define RCC_AHB1RSTR_GPIOARST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2rstr AHB2RSTR AHB2 peripheral reset register
@{*/

/** RCC_AHB2RSTR_OTGFSRST USB OTG FS module reset **/
#define RCC_AHB2RSTR_OTGFSRST		(1 << 7)
/** RCC_AHB2RSTR_DCMIRST Camera interface reset **/
#define RCC_AHB2RSTR_DCMIRST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3rstr AHB3RSTR AHB3 peripheral reset register
@{*/

/** RCC_AHB3RSTR_QSPIRST QUADSPI module reset **/
#define RCC_AHB3RSTR_QSPIRST		(1 << 1)
/** RCC_AHB3RSTR_FMCRST Flexible memory controller module reset **/
#define RCC_AHB3RSTR_FMCRST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1rstr APB1RSTR APB1 peripheral reset register
@{*/

/** RCC_APB1RSTR_DACRST DAC reset **/
#define RCC_APB1RSTR_DACRST		(1 << 29)
/** RCC_APB1RSTR_PWRRST Power interface reset **/
#define RCC_APB1RSTR_PWRRST		(1 << 28)
/** RCC_APB1RSTR_CAN2RST CAN2 reset **/
#define RCC_APB1RSTR_CAN2RST		(1 << 26)
/** RCC_APB1RSTR_CAN1RST CAN1 reset **/
#define RCC_APB1RSTR_CAN1RST		(1 << 25)
/** RCC_APB1RSTR_I2CFMP1RST I2CFMP1 reset **/
#define RCC_APB1RSTR_I2CFMP1RST		(1 << 24)
/** RCC_APB1RSTR_I2C3RST I2C3 reset **/
#define RCC_APB1RSTR_I2C3RST		(1 << 23)
/** RCC_APB1RSTR_I2C2RST I2C 2 reset **/
#define RCC_APB1RSTR_I2C2RST		(1 << 22)
/** RCC_APB1RSTR_I2C1RST I2C 1 reset **/
#define RCC_APB1RSTR_I2C1RST		(1 << 21)
/** RCC_APB1RSTR_UART5RST USART 5 reset **/
#define RCC_APB1RSTR_UART5RST		(1 << 20)
/** RCC_APB1RSTR_UART4RST USART 4 reset **/
#define RCC_APB1RSTR_UART4RST		(1 << 19)
/** RCC_APB1RSTR_UART3RST USART 3 reset **/
#define RCC_APB1RSTR_UART3RST		(1 << 18)
/** RCC_APB1RSTR_UART2RST USART 2 reset **/
#define RCC_APB1RSTR_UART2RST		(1 << 17)
/** RCC_APB1RSTR_SPDIFRST SPDIF-IN reset **/
#define RCC_APB1RSTR_SPDIFRST		(1 << 16)
/** RCC_APB1RSTR_SPI3RST SPI 3 reset **/
#define RCC_APB1RSTR_SPI3RST		(1 << 15)
/** RCC_APB1RSTR_SPI2RST SPI 2 reset **/
#define RCC_APB1RSTR_SPI2RST		(1 << 14)
/** RCC_APB1RSTR_WWDGRST Window watchdog reset **/
#define RCC_APB1RSTR_WWDGRST		(1 << 11)
/** RCC_APB1RSTR_TIM14RST TIM14 reset **/
#define RCC_APB1RSTR_TIM14RST		(1 << 8)
/** RCC_APB1RSTR_TIM13RST TIM13 reset **/
#define RCC_APB1RSTR_TIM13RST		(1 << 7)
/** RCC_APB1RSTR_TIM12RST TIM12 reset **/
#define RCC_APB1RSTR_TIM12RST		(1 << 6)
/** RCC_APB1RSTR_TIM7RST TIM7 reset **/
#define RCC_APB1RSTR_TIM7RST		(1 << 5)
/** RCC_APB1RSTR_TIM6RST TIM6 reset **/
#define RCC_APB1RSTR_TIM6RST		(1 << 4)
/** RCC_APB1RSTR_TIM5RST TIM5 reset **/
#define RCC_APB1RSTR_TIM5RST		(1 << 3)
/** RCC_APB1RSTR_TIM4RST TIM4 reset **/
#define RCC_APB1RSTR_TIM4RST		(1 << 2)
/** RCC_APB1RSTR_TIM3RST TIM3 reset **/
#define RCC_APB1RSTR_TIM3RST		(1 << 1)
/** RCC_APB1RSTR_TIM2RST TIM2 reset **/
#define RCC_APB1RSTR_TIM2RST		(1 << 0)

/**@}*/

