grevaillot/svd_tools/headers/STM32F446/rcc.h
/** @defgroup rcc_ahb1lpenr AHB1LPENR AHB1 peripheral clock enable in low power mode register
@{*/

/** RCC_AHB1LPENR_OTGHSULPILPEN USB OTG HS ULPI clock enable during Sleep mode **/
#define RCC_AHB1LPENR_OTGHSULPILPEN		(1 << 30)
/** RCC_AHB1LPENR_OTGHSLPEN USB OTG HS clock enable during Sleep mode **/
#define RCC_AHB1LPENR_OTGHSLPEN		(1 << 29)
/** RCC_AHB1LPENR_DMA2LPEN DMA2 clock enable during Sleep mode **/
#define RCC_AHB1LPENR_DMA2LPEN		(1 << 22)
/** RCC_AHB1LPENR_DMA1LPEN DMA1 clock enable during Sleep mode **/
#define RCC_AHB1LPENR_DMA1LPEN		(1 << 21)
/** RCC_AHB1LPENR_BKPSRAMLPEN Backup SRAM interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_BKPSRAMLPEN		(1 << 18)
/** RCC_AHB1LPENR_SRAM2LPEN SRAM 2 interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_SRAM2LPEN		(1 << 17)
/** RCC_AHB1LPENR_SRAM1LPEN SRAM 1interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_SRAM1LPEN		(1 << 16)
/** RCC_AHB1LPENR_FLITFLPEN Flash interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_FLITFLPEN		(1 << 15)
/** RCC_AHB1LPENR_CRCLPEN CRC clock enable during Sleep mode **/
#define RCC_AHB1LPENR_CRCLPEN		(1 << 12)
/** RCC_AHB1LPENR_GPIOHLPEN IO port H clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOHLPEN		(1 << 7)
/** RCC_AHB1LPENR_GPIOGLPEN IO port G clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOGLPEN		(1 << 6)
/** RCC_AHB1LPENR_GPIOFLPEN IO port F clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOFLPEN		(1 << 5)
/** RCC_AHB1LPENR_GPIOELPEN IO port E clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOELPEN		(1 << 4)
/** RCC_AHB1LPENR_GPIODLPEN IO port D clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIODLPEN		(1 << 3)
/** RCC_AHB1LPENR_GPIOCLPEN IO port C clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOCLPEN		(1 << 2)
/** RCC_AHB1LPENR_GPIOBLPEN IO port B clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOBLPEN		(1 << 1)
/** RCC_AHB1LPENR_GPIOALPEN IO port A clock enable during sleep mode **/
#define RCC_AHB1LPENR_GPIOALPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2lpenr AHB2LPENR AHB2 peripheral clock enable in low power mode register
@{*/

/** RCC_AHB2LPENR_OTGFSLPEN USB OTG FS clock enable during Sleep mode **/
#define RCC_AHB2LPENR_OTGFSLPEN		(1 << 7)
/** RCC_AHB2LPENR_DCMILPEN Camera interface enable during Sleep mode **/
#define RCC_AHB2LPENR_DCMILPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3lpenr AHB3LPENR AHB3 peripheral clock enable in low power mode register
@{*/

/** RCC_AHB3LPENR_QSPILPEN QUADSPI memory controller module clock enable during Sleep mode **/
#define RCC_AHB3LPENR_QSPILPEN		(1 << 1)
/** RCC_AHB3LPENR_FMCLPEN Flexible memory controller module clock enable during Sleep mode **/
#define RCC_AHB3LPENR_FMCLPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1lpenr APB1LPENR APB1 peripheral clock enable in low power mode register
@{*/

/** RCC_APB1LPENR_DACLPEN DAC interface clock enable during Sleep mode **/
#define RCC_APB1LPENR_DACLPEN		(1 << 29)
/** RCC_APB1LPENR_PWRLPEN Power interface clock enable during Sleep mode **/
#define RCC_APB1LPENR_PWRLPEN		(1 << 28)
/** RCC_APB1LPENR_CECLPEN CEC clock enable during Sleep mode **/
#define RCC_APB1LPENR_CECLPEN		(1 << 27)
/** RCC_APB1LPENR_CAN2LPEN CAN 2 clock enable during Sleep mode **/
#define RCC_APB1LPENR_CAN2LPEN		(1 << 26)
/** RCC_APB1LPENR_CAN1LPEN CAN 1 clock enable during Sleep mode **/
#define RCC_APB1LPENR_CAN1LPEN		(1 << 25)
/** RCC_APB1LPENR_I2CFMP1LPEN I2CFMP1 clock enable during Sleep mode **/
#define RCC_APB1LPENR_I2CFMP1LPEN		(1 << 24)
/** RCC_APB1LPENR_I2C3LPEN I2C3 clock enable during Sleep mode **/
#define RCC_APB1LPENR_I2C3LPEN		(1 << 23)
/** RCC_APB1LPENR_I2C2LPEN I2C2 clock enable during Sleep mode **/
#define RCC_APB1LPENR_I2C2LPEN		(1 << 22)
/** RCC_APB1LPENR_I2C1LPEN I2C1 clock enable during Sleep mode **/
#define RCC_APB1LPENR_I2C1LPEN		(1 << 21)
/** RCC_APB1LPENR_UART5LPEN UART5 clock enable during Sleep mode **/
#define RCC_APB1LPENR_UART5LPEN		(1 << 20)
/** RCC_APB1LPENR_UART4LPEN UART4 clock enable during Sleep mode **/
#define RCC_APB1LPENR_UART4LPEN		(1 << 19)
/** RCC_APB1LPENR_USART3LPEN USART3 clock enable during Sleep mode **/
#define RCC_APB1LPENR_USART3LPEN		(1 << 18)
/** RCC_APB1LPENR_USART2LPEN USART2 clock enable during Sleep mode **/
#define RCC_APB1LPENR_USART2LPEN		(1 << 17)
/** RCC_APB1LPENR_SPDIFLPEN SPDIF clock enable during Sleep mode **/
#define RCC_APB1LPENR_SPDIFLPEN		(1 << 16)
/** RCC_APB1LPENR_SPI3LPEN SPI3 clock enable during Sleep mode **/
#define RCC_APB1LPENR_SPI3LPEN		(1 << 15)
/** RCC_APB1LPENR_SPI2LPEN SPI2 clock enable during Sleep mode **/
#define RCC_APB1LPENR_SPI2LPEN		(1 << 14)
/** RCC_APB1LPENR_WWDGLPEN Window watchdog clock enable during Sleep mode **/
#define RCC_APB1LPENR_WWDGLPEN		(1 << 11)
/** RCC_APB1LPENR_TIM14LPEN TIM14 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM14LPEN		(1 << 8)
/** RCC_APB1LPENR_TIM13LPEN TIM13 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM13LPEN		(1 << 7)
/** RCC_APB1LPENR_TIM12LPEN TIM12 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM12LPEN		(1 << 6)
/** RCC_APB1LPENR_TIM7LPEN TIM7 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM7LPEN		(1 << 5)
/** RCC_APB1LPENR_TIM6LPEN TIM6 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM6LPEN		(1 << 4)
/** RCC_APB1LPENR_TIM5LPEN TIM5 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM5LPEN		(1 << 3)
/** RCC_APB1LPENR_TIM4LPEN TIM4 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM4LPEN		(1 << 2)
/** RCC_APB1LPENR_TIM3LPEN TIM3 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM3LPEN		(1 << 1)
/** RCC_APB1LPENR_TIM2LPEN TIM2 clock enable during Sleep mode **/
#define RCC_APB1LPENR_TIM2LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2lpenr APB2LPENR APB2 peripheral clock enabled in low power mode register
@{*/

/** RCC_APB2LPENR_SAI2LPEN SAI2 clock enable **/
#define RCC_APB2LPENR_SAI2LPEN		(1 << 23)
/** RCC_APB2LPENR_SAI1LPEN SAI1 clock enable **/
#define RCC_APB2LPENR_SAI1LPEN		(1 << 22)
/** RCC_APB2LPENR_TIM11LPEN TIM11 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM11LPEN		(1 << 18)
/** RCC_APB2LPENR_TIM10LPEN TIM10 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM10LPEN		(1 << 17)
/** RCC_APB2LPENR_TIM9LPEN TIM9 clock enable during sleep mode **/
#define RCC_APB2LPENR_TIM9LPEN		(1 << 16)
/** RCC_APB2LPENR_SYSCFGLPEN System configuration controller clock enable during Sleep mode **/
#define RCC_APB2LPENR_SYSCFGLPEN		(1 << 14)
/** RCC_APB2LPENR_SPI4LPEN SPI 4 clock enable during Sleep mode **/
#define RCC_APB2LPENR_SPI4LPEN		(1 << 13)
/** RCC_APB2LPENR_SPI1LPEN SPI 1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_SPI1LPEN		(1 << 12)
/** RCC_APB2LPENR_SDIOLPEN SDIO clock enable during Sleep mode **/
#define RCC_APB2LPENR_SDIOLPEN		(1 << 11)
/** RCC_APB2LPENR_ADC3LPEN ADC 3 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC3LPEN		(1 << 10)
/** RCC_APB2LPENR_ADC2LPEN ADC2 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC2LPEN		(1 << 9)
/** RCC_APB2LPENR_ADC1LPEN ADC1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC1LPEN		(1 << 8)
/** RCC_APB2LPENR_USART6LPEN USART6 clock enable during Sleep mode **/
#define RCC_APB2LPENR_USART6LPEN		(1 << 5)
/** RCC_APB2LPENR_USART1LPEN USART1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_USART1LPEN		(1 << 4)
/** RCC_APB2LPENR_TIM8LPEN TIM8 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM8LPEN		(1 << 1)
/** RCC_APB2LPENR_TIM1LPEN TIM1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM1LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_bdcr BDCR Backup domain control register
@{*/

/** RCC_BDCR_BDRST Backup domain software reset **/
#define RCC_BDCR_BDRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)

