grevaillot/svd_tools/headers/STM32F446/rcc.h
#define RCC_BDCR_RTCSEL_SHIFT		8
#define RCC_BDCR_RTCSEL_MASK		0x03
/** @defgroup rcc_bdcr_rtcsel RTCSEL RTC clock source selection
@{*/
/**@}*/

/** RCC_BDCR_LSEMOD External low-speed oscillator mode **/
#define RCC_BDCR_LSEMOD		(1 << 3)
/** RCC_BDCR_LSEBYP External low-speed oscillator bypass **/
#define RCC_BDCR_LSEBYP		(1 << 2)
/** RCC_BDCR_LSERDY External low-speed oscillator ready **/
#define RCC_BDCR_LSERDY		(1 << 1)
/** RCC_BDCR_LSEON External low-speed oscillator enable **/
#define RCC_BDCR_LSEON		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR clock control & status register
@{*/

/** RCC_CSR_LPWRRSTF Low-power reset flag **/
#define RCC_CSR_LPWRRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_WDGRSTF Independent watchdog reset flag **/
#define RCC_CSR_WDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_PORRSTF POR/PDR reset flag **/
#define RCC_CSR_PORRSTF		(1 << 27)
/** RCC_CSR_PADRSTF PIN reset flag **/
#define RCC_CSR_PADRSTF		(1 << 26)
/** RCC_CSR_BORRSTF BOR reset flag **/
#define RCC_CSR_BORRSTF		(1 << 25)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 24)
/** RCC_CSR_LSIRDY Internal low-speed oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION Internal low-speed oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_sscgr SSCGR spread spectrum clock generation register
@{*/

/** RCC_SSCGR_SSCGEN Spread spectrum modulation enable **/
#define RCC_SSCGR_SSCGEN		(1 << 31)
/** RCC_SSCGR_SPREADSEL Spread Select **/
#define RCC_SSCGR_SPREADSEL		(1 << 30)

#define RCC_SSCGR_INCSTEP_SHIFT		13
#define RCC_SSCGR_INCSTEP_MASK		0x7fff
/** @defgroup rcc_sscgr_incstep INCSTEP Incrementation step
@{*/
/**@}*/


#define RCC_SSCGR_MODPER_SHIFT		0
#define RCC_SSCGR_MODPER_MASK		0x1fff
/** @defgroup rcc_sscgr_modper MODPER Modulation period
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_plli2scfgr PLLI2SCFGR PLLI2S configuration register
@{*/


#define RCC_PLLI2SCFGR_PLLI2SR_SHIFT		28
#define RCC_PLLI2SCFGR_PLLI2SR_MASK		0x07
/** @defgroup rcc_plli2scfgr_plli2sr PLLI2SR PLLI2S division factor for I2S clocks
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SQ_SHIFT		24
#define RCC_PLLI2SCFGR_PLLI2SQ_MASK		0x0f
/** @defgroup rcc_plli2scfgr_plli2sq PLLI2SQ PLLI2S division factor for SAI1 clock
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SP_SHIFT		16
#define RCC_PLLI2SCFGR_PLLI2SP_MASK		0x03
/** @defgroup rcc_plli2scfgr_plli2sp PLLI2SP PLLI2S division factor for SPDIF-IN clock
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SN_SHIFT		6
#define RCC_PLLI2SCFGR_PLLI2SN_MASK		0x1ff
/** @defgroup rcc_plli2scfgr_plli2sn PLLI2SN PLLI2S multiplication factor for VCO
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SM_SHIFT		0
#define RCC_PLLI2SCFGR_PLLI2SM_MASK		0x3f
/** @defgroup rcc_plli2scfgr_plli2sm PLLI2SM Division factor for audio PLL (PLLI2S) input clock
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllsaicfgr PLLSAICFGR PLL configuration register
@{*/


#define RCC_PLLSAICFGR_PLLSAIQ_SHIFT		24
#define RCC_PLLSAICFGR_PLLSAIQ_MASK		0x0f
/** @defgroup rcc_pllsaicfgr_pllsaiq PLLSAIQ PLLSAI division factor for SAIs clock
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIP_SHIFT		16
#define RCC_PLLSAICFGR_PLLSAIP_MASK		0x03
/** @defgroup rcc_pllsaicfgr_pllsaip PLLSAIP PLLSAI division factor for 48 MHz clock
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIN_SHIFT		6
#define RCC_PLLSAICFGR_PLLSAIN_MASK		0x1ff
/** @defgroup rcc_pllsaicfgr_pllsain PLLSAIN PLLSAI division factor for VCO
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIM_SHIFT		0
#define RCC_PLLSAICFGR_PLLSAIM_MASK		0x3f
/** @defgroup rcc_pllsaicfgr_pllsaim PLLSAIM Division factor for audio PLLSAI input clock
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_dckcfgr DCKCFGR Dedicated Clock Configuration Register
@{*/


#define RCC_DCKCFGR_I2S2SRC_SHIFT		27
#define RCC_DCKCFGR_I2S2SRC_MASK		0x03
/** @defgroup rcc_dckcfgr_i2s2src I2S2SRC I2S APB2 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR_I2S1SRC_SHIFT		25
#define RCC_DCKCFGR_I2S1SRC_MASK		0x03
/** @defgroup rcc_dckcfgr_i2s1src I2S1SRC I2S APB1 clock source selection
@{*/
/**@}*/

/** RCC_DCKCFGR_TIMPRE Timers clocks prescalers selection **/
#define RCC_DCKCFGR_TIMPRE		(1 << 24)

#define RCC_DCKCFGR_SAI2SRC_SHIFT		22
#define RCC_DCKCFGR_SAI2SRC_MASK		0x03
/** @defgroup rcc_dckcfgr_sai2src SAI2SRC SAI2 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR_SAI1SRC_SHIFT		20
#define RCC_DCKCFGR_SAI1SRC_MASK		0x03
/** @defgroup rcc_dckcfgr_sai1src SAI1SRC SAI1 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR_PLLSAIDIVQ_SHIFT		8
#define RCC_DCKCFGR_PLLSAIDIVQ_MASK		0x1f
/** @defgroup rcc_dckcfgr_pllsaidivq PLLSAIDIVQ PLLSAI division factor for SAIs clock
@{*/
/**@}*/


#define RCC_DCKCFGR_PLLI2SDIVQ_SHIFT		0
#define RCC_DCKCFGR_PLLI2SDIVQ_MASK		0x1f
/** @defgroup rcc_dckcfgr_plli2sdivq PLLI2SDIVQ PLLI2S division factor for SAIs clock
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_ckgatenr CKGATENR clocks gated enable register
@{*/

/** RCC_CKGATENR_RCC_CKEN RCC clock enable **/
#define RCC_CKGATENR_RCC_CKEN		(1 << 6)
/** RCC_CKGATENR_FLITF_CKEN Flash Interface clock enable **/
#define RCC_CKGATENR_FLITF_CKEN		(1 << 5)
/** RCC_CKGATENR_SRAM_CKEN SRQAM controller clock enable **/
#define RCC_CKGATENR_SRAM_CKEN		(1 << 4)
/** RCC_CKGATENR_SPARE_CKEN Spare clock enable **/
#define RCC_CKGATENR_SPARE_CKEN		(1 << 3)
/** RCC_CKGATENR_CM4DBG_CKEN Cortex M4 ETM clock enable **/
#define RCC_CKGATENR_CM4DBG_CKEN		(1 << 2)
/** RCC_CKGATENR_AHB2APB2_CKEN AHB to APB2 Bridge clock enable **/
#define RCC_CKGATENR_AHB2APB2_CKEN		(1 << 1)
/** RCC_CKGATENR_AHB2APB1_CKEN AHB to APB1 Bridge clock enable **/
#define RCC_CKGATENR_AHB2APB1_CKEN		(1 << 0)

/**@}*/

/** @defgroup rcc_dckcfgr2 DCKCFGR2 dedicated clocks configuration register 2
@{*/

/** RCC_DCKCFGR2_SPDIFSEL SPDIF clock selection **/
#define RCC_DCKCFGR2_SPDIFSEL		(1 << 29)
/** RCC_DCKCFGR2_SDIOSEL SDIO clock selection **/
#define RCC_DCKCFGR2_SDIOSEL		(1 << 28)
/** RCC_DCKCFGR2_CK48MSEL SDIO/USBFS/HS clock selection **/
#define RCC_DCKCFGR2_CK48MSEL		(1 << 27)
/** RCC_DCKCFGR2_CECSEL HDMI CEC clock source selection **/
#define RCC_DCKCFGR2_CECSEL		(1 << 26)

#define RCC_DCKCFGR2_FMPI2C1SEL_SHIFT		22
#define RCC_DCKCFGR2_FMPI2C1SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_fmpi2c1sel FMPI2C1SEL I2C4 kernel clock source selection
@{*/
/**@}*/


/**@}*/
